In [15]:
import pandas as pd
import numpy as np

In [1]:
world = { 'country': ['turkey', 'greece', 'france'],
           'indepyear': [1000,1500, 2000],
           'population': [10000,20000,30000]}

In [4]:
frame = pd.DataFrame(world)

In [5]:
frame

  country  indepyear  population
0  turkey       1000       10000
1  greece       1500       20000
2  france       2000       30000

In [6]:
frame.head()

  country  indepyear  population
0  turkey       1000       10000
1  greece       1500       20000
2  france       2000       30000

In [7]:
frame.tail()

  country  indepyear  population
0  turkey       1000       10000
1  greece       1500       20000
2  france       2000       30000

In [8]:
pd.DataFrame(world, columns=["ulke",'year','pop'])

Empty DataFrame
Columns: [ulke, year, pop]
Index: []

In [9]:
frame.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
frame.columns

Index(['country', 'indepyear', 'population'], dtype='object')

In [11]:
frame['country']

0    turkey
1    greece
2    france
Name: country, dtype: object

In [12]:
frame.country

0    turkey
1    greece
2    france
Name: country, dtype: object

In [13]:
frame['debt'] =  100000

In [14]:
frame.head()

  country  indepyear  population    debt
0  turkey       1000       10000  100000
1  greece       1500       20000  100000
2  france       2000       30000  100000

In [16]:
frame['gnp'] = np.linspace(5000,25000,3)

In [17]:
frame.head()

  country  indepyear  population    debt      gnp
0  turkey       1000       10000  100000   5000.0
1  greece       1500       20000  100000  15000.0
2  france       2000       30000  100000  25000.0

In [18]:
continents = pd.Series(['asia','europe','europe'],index=[0,1,2])
frame['continent'] = continents

In [19]:
frame.head()

  country  indepyear  population    debt      gnp continent
0  turkey       1000       10000  100000   5000.0      asia
1  greece       1500       20000  100000  15000.0    europe
2  france       2000       30000  100000  25000.0    europe

In [20]:
frame['rich'] = frame.country == 'turkey'

In [21]:
frame.head()

  country  indepyear  population    debt      gnp continent   rich
0  turkey       1000       10000  100000   5000.0      asia   True
1  greece       1500       20000  100000  15000.0    europe  False
2  france       2000       30000  100000  25000.0    europe  False

In [22]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     3 non-null      object
 1   indepyear   3 non-null      int64
 2   population  3 non-null      int64
 3   debt        3 non-null      int64
 4   gnp         3 non-null      float64
 5   continent   3 non-null      object
 6   rich        3 non-null      bool
dtypes: bool(1), float64(1), int64(3), object(2)
memory usage: 275.0+ bytes

In [23]:
frame.describe()

       indepyear  population      debt      gnp
count        3.0         3.0       3.0      3.0
mean      1500.0     20000.0  100000.0  15000.0
std        500.0     10000.0       0.0  10000.0
min       1000.0     10000.0  100000.0   5000.0
25%       1250.0     15000.0  100000.0  10000.0
50%       1500.0     20000.0  100000.0  15000.0
75%       1750.0     25000.0  100000.0  20000.0
max       2000.0     30000.0  100000.0  25000.0

In [24]:
frame.cov()

            indepyear   population  debt          gnp         rich
indepyear    250000.0    5000000.0   0.0    5000000.0  -250.000000
population  5000000.0  100000000.0   0.0  100000000.0 -5000.000000
debt              0.0          0.0   0.0          0.0     0.000000
gnp         5000000.0  100000000.0   0.0  100000000.0 -5000.000000
rich           -250.0      -5000.0   0.0      -5000.0     0.333333

In [25]:
frame

  country  indepyear  population    debt      gnp continent   rich
0  turkey       1000       10000  100000   5000.0      asia   True
1  greece       1500       20000  100000  15000.0    europe  False
2  france       2000       30000  100000  25000.0    europe  False

In [26]:
frame.T

                 0       1       2
country     turkey  greece  france
indepyear     1000    1500    2000
population   10000   20000   30000
debt        100000  100000  100000
gnp           5000   15000   25000
continent     asia  europe  europe
rich          True   False   False

In [27]:
frame.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
frame.columns

Index(['country', 'indepyear', 'population', 'debt', 'gnp', 'continent',
       'rich'],
      dtype='object')

In [29]:
frame.values

array([['turkey', 1000, 10000, 100000, 5000.0, 'asia', True],
       ['greece', 1500, 20000, 100000, 15000.0, 'europe', False],
       ['france', 2000, 30000, 100000, 25000.0, 'europe', False]],
      dtype=object)

In [30]:
'country' in frame.columns

True

In [31]:
2 in frame.index

True

In [32]:
'test' in frame.columns

False

In [33]:
42 in frame.index

False

In [34]:
ser = pd.Series([1.1, 2.2, 3.3, -4.4], index=['d', 'b', 'a', 'c'])

In [35]:
ser

d    1.1
b    2.2
a    3.3
c   -4.4
dtype: float64

In [36]:
ser1 = ser.reindex(['a', 'b','c','d', 'e'])

In [37]:
ser1

a    3.3
b    2.2
c   -4.4
d    1.1
e    NaN
dtype: float64

In [38]:
ser2 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])

In [39]:
ser2

0      blue
2    purple
4    yellow
dtype: object

In [40]:
ser2.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [41]:
frame3 = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                     columns=['turkey', 'france', 'greece'])

In [42]:
frame3

   turkey  france  greece
a       0       1       2
c       3       4       5
d       6       7       8

In [43]:
frame4 = frame3.reindex(['a','b','c','d'])

In [44]:
frame4

   turkey  france  greece
a     0.0     1.0     2.0
b     NaN     NaN     NaN
c     3.0     4.0     5.0
d     6.0     7.0     8.0

In [45]:
countries = ['turkey', 'greece', 'italy']

In [47]:
frame5 = frame3.reindex(columns=countries)

In [48]:
frame5

   turkey  greece  italy
a       0       2    NaN
c       3       5    NaN
d       6       8    NaN

In [49]:
frame4

   turkey  france  greece
a     0.0     1.0     2.0
b     NaN     NaN     NaN
c     3.0     4.0     5.0
d     6.0     7.0     8.0

In [55]:
frame4.loc[['a','d']]

   turkey  france  greece
a     0.0     1.0     2.0
d     6.0     7.0     8.0

In [56]:
frame4

   turkey  france  greece
a     0.0     1.0     2.0
b     NaN     NaN     NaN
c     3.0     4.0     5.0
d     6.0     7.0     8.0

In [61]:
frame4.drop('france', axis=1, inplace=True)

In [62]:
frame4

   turkey  greece
a     0.0     2.0
b     NaN     NaN
c     3.0     5.0
d     6.0     8.0

In [63]:
ser5 = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [64]:
ser5

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [65]:
ser5['c']

2.0

In [66]:
ser5[2]

2.0

In [67]:
ser5[2:4]

c    2.0
d    3.0
dtype: float64

In [68]:
ser5[['b','d','a']]

b    1.0
d    3.0
a    0.0
dtype: float64

In [69]:
ser5[[1,3,0]]

b    1.0
d    3.0
a    0.0
dtype: float64

In [70]:
ser5[ser5 < 2]

a    0.0
b    1.0
dtype: float64

In [71]:
ser5['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [72]:
ser5['b':'d'] = 42.

In [74]:
ser5

a     0.0
b    42.0
c    42.0
d    42.0
dtype: float64

In [75]:
frame8 = pd.DataFrame(np.arange(16).reshape((4,4)),columns=['one','two','three','four'],
                     index=['turkey', 'france', 'greece', 'germany'])

In [76]:
frame8

         one  two  three  four
turkey     0    1      2     3
france     4    5      6     7
greece     8    9     10    11
germany   12   13     14    15

In [79]:
frame8[['two','four']]

         two  four
turkey     1     3
france     5     7
greece     9    11
germany   13    15

In [80]:
frame8[:2]

        one  two  three  four
turkey    0    1      2     3
france    4    5      6     7

In [81]:
frame8[frame8['three'] > 6]

         one  two  three  four
greece     8    9     10    11
germany   12   13     14    15

In [83]:
frame8['three'] > 6

turkey     False
france     False
greece      True
germany     True
Name: three, dtype: bool

In [85]:
frame8 > 6

           one    two  three   four
turkey   False  False  False  False
france   False  False  False   True
greece    True   True   True   True
germany   True   True   True   True

In [95]:
frame8[frame8 == 0] = 42

In [96]:
frame8

         one  two  three  four
turkey    42    1      2     3
france     4    5      6    42
greece    42   42     42    42
germany   42   42     42    42

In [92]:
frame8.loc['turkey',['two','three']]

two      1
three    2
Name: turkey, dtype: int32

In [94]:
frame8.iloc[0,[1,2]]

two      1
three    2
Name: turkey, dtype: int32

In [98]:
1 / frame8

             one      two     three      four
turkey   0.02381  1.00000  0.500000  0.333333
france   0.25000  0.20000  0.166667  0.023810
greece   0.02381  0.02381  0.023810  0.023810
germany  0.02381  0.02381  0.023810  0.023810

In [100]:
frame8.rdiv(1)

             one      two     three      four
turkey   0.02381  1.00000  0.500000  0.333333
france   0.25000  0.20000  0.166667  0.023810
greece   0.02381  0.02381  0.023810  0.023810
germany  0.02381  0.02381  0.023810  0.023810

In [102]:
frame8.sort_index(axis=1)

         four  one  three  two
turkey      3   42      2    1
france     42    4      6    5
greece     42   42     42   42
germany    42   42     42   42

In [105]:
ser8 = pd.Series([15, 16,23, 42,4, 8])

In [107]:
ser8.sort_values()

4     4
5     8
0    15
1    16
2    23
3    42
dtype: int64

In [109]:
ser8

0    15
1    16
2    23
3    42
4     4
5     8
dtype: int64

In [110]:
frame8.sort_values(by=['two', 'three'])

         one  two  three  four
turkey    42    1      2     3
france     4    5      6    42
greece    42   42     42    42
germany   42   42     42    42